[
    {
        "name": "Didactypo",
        "subtitle": "Team project",
        "url": "https://didactypo.gamberge.org",
        "image": "https://github.com/Team-Maitrobe/DidactypoFront/blob/master/src/img/logoDidactypo.png?raw=true",
        "github": "https://github.com/Team-Maitrobe/DidactypoFront",
        "description": "Didactypo is a free, open-source website designed to help primary school students (ages 6-11) learn touch typing in a fun and educational way. It offers structured lessons followed by interactive exercises to improve typing speed and accuracy. Teachers can create classes, track student progress, and assign courses directly through the platform. The site also features weekly typing challenges with leaderboards and badges to encourage competition. In an increasingly digital world, Didactypo aims to make typing an essential skill for young learners.",
        "implication":"Didactypo was a 4-person project where I was one of 2 developers working on the backend. We worked with a Scrum work method and I took on the role of scrum master. I helped construct the database structure and integrated the chat rooms on my own (with Firebase). What started as just a school project quickly became a full-on passion project which we decided to maintain several months after. The whole school would play the weekly challenges, proving that we surpassed the original point.",
        "startDate" : "September 2024",
        "endDate" : "May 2025",
        "technologies": ["React", "TypeScript", "FastAPI", "Firebase", "Python", "CSS", "Scrum"],
        "keywords": ["fullstack", "education", "typing", "gamification"]
    },
    {
        "name": "DESCAR T",
        "subtitle": "Professional project",
        "url": "https://experts-recherche-lymphome.org/lysa/parcourir-les-etudes-cliniques-en-cours/descar-t/",
        "image": "https://experts-recherche-lymphome.org/wp-content/uploads/lysa/Etudes-Lysa/DESCAR-T/descart-t.png.webp",
        "github": "",
        "description": "DESCAR-T is a massive medical database with countless ammounts of patient data in constant evolution.",
        "implication":"I developed comprehensive Power BI solutions for biostatisticians, project managers, and pharmaceutical lab representatives to analyze the DESCAR-T medical data. I extracted, transformed, and cleaned complex healthcare data using SAS and SQL, ensuring high data quality and consistency for a longitudinal database tracking over 5000 patients across France. I designed interactive dashboards and performance indicators in Power BI that supported data-driven decision-making for medical professionals and pharmaceutical stakeholders. Working closely with multidisciplinary teams, I translated medical and scientific requirements into actionable insights and visual analytics while maintaining strict compliance with data privacy regulations for sensitive patient information.",
        "startDate" : "April 2025",
        "endDate" : "July 2025",
        "technologies": ["Power BI", "SAS", "SQL"],
        "keywords": ["healthcare", "data analytics", "ETL", "data visualization", "dashboard development", "data privacy"]
    },
    {
        "name": "Breast Cancer Detector",
        "subtitle": "Personal project",
        "url": "",
        "image": "https://deepnote.com/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fjupyter.3224ecc9.png&w=3840&q=75",
        "github": "https://github.com/XavierLeClavier/breast-cancer-detection",
        "description": "A machine learning project utilizing scikit-learn and the well-known breast cancer dataset. It demonstrates data preprocessing, model training, and evaluation techniques to predict breast cancer outcomes.",
        "implication" : "This was a small project I created as part of the University of Michigan Applied Machine Learning in Python course.",
        "startDate" : "March 2024",
        "endDate" : "",
        "technologies": ["Jupyter", "Python", "SkLearn", "AI/ML"],
        "keywords": ["AI", "ML", "K-Nearest Neighbours", "classification"]
    },
    {
        "name": "Self tracker",
        "subtitle": "Personal project",
        "url": "https://self.gamberge.org",
        "image": "https://imgs.search.brave.com/xG4QAnXrlBOSf1NvJkYDbXMEAGtKs_iHQf_eRY4ixUs/rs:fit:860:0:0:0/g:ce/aHR0cHM6Ly9tZWRp/YS5pc3RvY2twaG90/by5jb20vaWQvMTE3/ODA3NjM3NS9waG90/by9zbWFydHBob25l/LXBob3RvLW9mLWRl/bGljaW91cy1mb29k/LndlYnA_YT0xJmI9/MSZzPTYxMng2MTIm/dz0wJms9MjAmYz1X/RkUxRTZ4OGxvck1l/VG9PNm5SbnBnWVUy/R19KbmdobXhJRXZU/VUhzYklVPQ",
        "github": "https://github.com/XavierLeClavier/self-tracker",
        "description": "Selft Tracker is a web app designed to track the meals of my colleagues and I during our workdays. It allows users to log their meals and provides statistics and rankings based on the logged data. The meal's calory, protein and fat content are also automatically determined through AI. The app is build with a React frontend and Express backend, and uses PostgreSQL for data storage.",
        "implication":"I built this app from scratch in a couple of weeks to help my colleagues and I track our meals during workdays. It was a fun project where I learned a lot about AI integration and database management. This was mostly to fammiliarize myself with Express, PostgreSQL and AI integration.",
        "startDate" : "September 2025",
        "endDate" : "now",
        "technologies": ["React", "Express", "PostgreSQL", "AI/ML", "Docker"],
        "keywords": ["fullstack", "AI", "database", "tracking", "statistics"]
    },
    {
        "name" : "Home server",
        "subtitle" : "Personal project",
        "url" : "",
        "image" : "https://raspberry-pi.fr/wp-content/uploads/2016/03/raspberry-pi-3-accessoires-939x512.jpg",
        "github" : "",
        "description" : "A Raspberry Pi 3B transformed into a small but effective webserver. I use this server to store all my different websites as well as my calendar. My websites are stored using a LAMP configuration, I've also setup a secure SSH and VPN to connect to it from anwhere.",
        "implication" : "I started working on this server during my first year of bachelor's degree, and I still use it now ! This is the server where this website is stored for example.",
        "startDate" : "November 2023",
        "endDate" : "now",
        "technologies" : ["Linux", "Apache Server", "MySQL", "PHP", "Docker"],
        "keywords" : ["LAMP", "server", "cyber-security", "SSH", "container"]
    },
    {
        "name": "Fou2Food",
        "subtitle": "School project",
        "url": "https://fou2food.gamberge.org",
        "image": "https://github.com/Team-Maitrobe/blogPHP/blob/main/img/Fou2food.png?raw=true",
        "github": "https://github.com/Team-Maitrobe/blogPHP",
        "description": "Fou2Food is a blog dedicated to food lovers. It allows users to share their opinions and experiences with various restaurants. Users can create an account, write reviews, and interact with other food enthusiasts. The platform aims to foster a community of foodies who can exchange tips and recommendations.",
        "implication" : "This was a 3-person project as part of our PHP class of second year bachelor. I constructed the database structure and mostly worked on the CRUD.",
        "startDate" : "October 2024",
        "endDate" : "November 2024",
        "technologies": ["PHP", "CSS", "MySQL"],
        "keywords": ["fullstack", "food", "blog", "community", "CRUD"]
    },
    {
        "name": "Codeco",
        "subtitle": "Personal project",
        "url": "https://codeco.gamberge.org",
        "image": "https://github.com/XavierLeClavier/codeco/blob/master/src/img/codeco.png?raw=true",
        "github": "https://github.com/XavierLeClavier/Codeco",
        "description": "If you're an entertainer looking to add a touch of adventure to your games, struggling to decode a secret message, or simply fascinated by codes, you've come to the right place! We are excited to share our passion for secret codes and puzzles with you. Whether it's for thrilling treasure hunts, intriguing scavenger hunts, or dynamic group activities, Codeco is here to bring a spark of creativity to your events.",
        "implication" : "During my first year studying computer science, I had a one-week break between two semesters. I decided to build Codeco despite no knowledge in JS frameworks or JS during that week. While it took a lot of effort and loooong hours of learning, coding and debugging, I was very proud of my result back then. I also use this website regularly as a Scout Leader to prepare acivities.",
        "startDate" : "January 2024",
        "endDate" : "April 2024",
        "technologies": ["React", "Tailwind", "JavaScript"],
        "keywords": ["frontend", "decoding", "puzzles"]
    },
    {
        "name": "My Portfolio",
        "subtitle": "Personal project",
        "url": "/version-log",
        "image": "https://avatars.githubusercontent.com/u/146034833?v=4",
        "github": "https://github.com/XavierLeClavier/Portfolio",
        "description": "This portfolio showcases my projects and skills. It is built using React TS and Tailwind CSS, the design is responsive and user-friendly, allowing visitors to easily navigate through my work. I use JSON files to store and manage my project data, making it easy to update and maintain the portfolio as I complete new projects. I also track visitor statistics using Cronitor.",
        "implication" : "This is the site you're on right now ! I've had a lot of fun building it and I still update it regularly to add new projects and features.",
        "startDate" : "March 2025",
        "endDate" : "now",
        "technologies": ["React", "TypeScript", "Tailwind", "JSON", "Cronitor"],
        "keywords": ["frontend", "portfolio", "design", "tracking"]
    },
    {
        "name": "Secured Air Enforcer",
        "subtitle": "School project",
        "url": "",
        "image": "https://cdn-icons-png.flaticon.com/512/6557/6557822.png",
        "github": "https://github.com/NoFlyListInc/SecuredAirEnforcer",
        "description": "Secured Air Enforcer is a Java-based project that simulates air traffic management with a focus on safety and efficiency. It uses the GraphStream and OpenStreetMap libraries to represent the different flight courses over France.",
        "implication" : "This project was the biggest one of my first year of bachelor's degree. I worked on the algorithms for coloring the graph and finding the shortest routes, which were critical for optimizing airspace usage and ensuring safe flight paths. Our algorithms were part of a school-wide competition, where we ranked among the best for their efficiency and innovation.",
        "startDate" : "April 2024",
        "endDate" : "June 2024",
        "technologies": ["Java", "GraphStream", "OpenStreetMap"],
        "keywords": ["graph", "algorithmic", "application"]
    },
    {
        "name": "Shared Coffee Project",
        "subtitle": "School project",
        "url": "https://sharedcoffee.gamberge.org",
        "image": "https://github.com/XavierLeClavier/SharedCoffeeProject/blob/main/sharedcoffeeproject/src/img/logo.png?raw=true",
        "github": "https://github.com/XavierLeClavier/SharedCoffeeProject",
        "description": "The Shared Coffee Project is a student-run campaign aiming to help people in need by sharing a coffee and a warm place to stay. We base our model on the 'suspended coffee' concept, where you can buy a coffee for someone else who can't afford it. We also provide a map of coffee shops that participate in the project.",
        "implication" : "This was part of an english project where we had to simulate a fundraiser event. I decided to build this website in a couple of days.",
        "startDate" : "June 2024",
        "endDate" : "",
        "technologies": ["React", "Tailwind"],
        "keywords": ["UX/UI", "design", "community"]
    }
]